# 1. Problem Overview
Prepare and engineer structured features from multiple relational datasets
to build a classification model that predicts whether a film
will have a high rating (≥ 7).

In [63]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

pd.set_option("display.max_columns", None)

In [64]:
import os
os.getcwd()

'/home/utsb/.app/Code/movie-rating-prediction/notebooks'

## 2. Data Loading

In [65]:
films = pd.read_csv("../data/raw/films.csv")
reviews = pd.read_csv("../data/raw/reviews.csv")
people = pd.read_csv("../data/raw/people.csv")
roles = pd.read_csv("../data/raw/roles.csv")

print("Films:", films.shape)
print("Reviews:", reviews.shape)
print("People:", people.shape)
print("Roles:", roles.shape)

Films: (4967, 9)
Reviews: (4967, 6)
People: (8396, 4)
Roles: (19790, 4)

In [66]:
films.head()

,1,Intolerance: Love's Struggle Throughout the Ages,1916.0,USA,123.0,Unnamed: 5,Not Rated,Unnamed: 7,385907.0
0,2,Over the Hill to the Poorhouse,1920.0,USA,110.0,NaN,NaN,3000000.0,100000.0
1,3,The Big Parade,1925.0,USA,151.0,NaN,Not Rated,NaN,245000.0
2,4,Metropolis,1927.0,Germany,145.0,German,Not Rated,26435.0,6000000.0
3,5,Pandora's Box,1929.0,Germany,110.0,German,Not Rated,9950.0,NaN
4,6,The Broadway Melody,1929.0,USA,100.0,English,Passed,2808000.0,379000.0

In [68]:
films.info()

<class 'pandas.DataFrame'>
RangeIndex: 4967 entries, 0 to 4966
Data columns (total 9 columns):
 #   Column                                            Non-Null Count  Dtype
---  ------                                            --------------  -----
 0   1                                                 4967 non-null   int64
 1   Intolerance: Love's Struggle Throughout the Ages  4967 non-null   str
 2   1916.0                                            4925 non-null   float64
 3   USA                                               4965 non-null   str
 4   123.0                                             4954 non-null   float64
 5   Unnamed: 5                                        4955 non-null   str
 6   Not Rated                                         4665 non-null   str
 7   Unnamed: 7                                        4158 non-null   float64
 8   385907.0                                          4537 non-null   float64
dtypes: float64(4), int64(1), str(4)
memory usage: 349.4 KB

## 3. Data Cleaning
- Fixed malformed CSV headers
- Handled missing numeric values
- Converted datatypes

In [71]:
films.columns
reviews.columns
roles.columns
people.columns

Index(['1', '50 Cent', '1975-07-06', 'Unnamed: 3'], dtype='str')

In [72]:
films = pd.read_csv("../data/raw/films.csv", header=None)
films.head()

,0,1,2,3,4,5,6,7,8
0,1,Intolerance: Love's Struggle Throughout the Ages,1916.0,USA,123.0,NaN,Not Rated,NaN,385907.0
1,2,Over the Hill to the Poorhouse,1920.0,USA,110.0,NaN,NaN,3000000.0,100000.0
2,3,The Big Parade,1925.0,USA,151.0,NaN,Not Rated,NaN,245000.0
3,4,Metropolis,1927.0,Germany,145.0,German,Not Rated,26435.0,6000000.0
4,5,Pandora's Box,1929.0,Germany,110.0,German,Not Rated,9950.0,NaN

In [73]:
films.columns

Index([0, 1, 2, 3, 4, 5, 6, 7, 8], dtype='int64')

In [74]:
films.columns = [
    "id",
    "title",
    "year",
    "country",
    "runtime",
    "language",
    "certificate",
    "budget",
    "revenue"
]

In [75]:
films.head()
films.info()

<class 'pandas.DataFrame'>
RangeIndex: 4968 entries, 0 to 4967
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           4968 non-null   int64
 1   title        4968 non-null   str
 2   year         4926 non-null   float64
 3   country      4966 non-null   str
 4   runtime      4955 non-null   float64
 5   language     4955 non-null   str
 6   certificate  4666 non-null   str
 7   budget       4158 non-null   float64
 8   revenue      4538 non-null   float64
dtypes: float64(4), int64(1), str(4)
memory usage: 349.4 KB

In [76]:
films.isnull().sum()

id               0
title            0
year            42
country          2
runtime         13
language        13
certificate    302
budget         810
revenue        430
dtype: int64

In [77]:
films["year"] = films["year"].fillna(films["year"].median())

In [78]:
films["year"] = films["year"].fillna(films["year"].median())

In [79]:
films["budget"] = films["budget"].fillna(0)
films["revenue"] = films["revenue"].fillna(0)

In [18]:
films["year"] = films["year"].astype(int)
films["runtime"] = films["runtime"].astype(int)

SyntaxError: invalid syntax (1011908466.py, line 1)

In [80]:
films["year"] = films["year"].astype(int)
films["runtime"] = films["runtime"].astype(int)

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer.Replace or remove non-finite values or cast to an integer typethat supports these values (e.g. 'Int64')

In [81]:
films["runtime"].isnull().sum()
films["year"].isnull().sum()

np.int64(0)

In [82]:
films["year"] = films["year"].fillna(films["year"].median())
films["runtime"] = films["runtime"].fillna(films["runtime"].median())

In [83]:
films["year"] = films["year"].astype(int)
films["runtime"] = films["runtime"].astype(int)

In [84]:
films.info()

<class 'pandas.DataFrame'>
RangeIndex: 4968 entries, 0 to 4967
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           4968 non-null   int64
 1   title        4968 non-null   str
 2   year         4968 non-null   int64
 3   country      4966 non-null   str
 4   runtime      4968 non-null   int64
 5   language     4955 non-null   str
 6   certificate  4666 non-null   str
 7   budget       4968 non-null   float64
 8   revenue      4968 non-null   float64
dtypes: float64(2), int64(3), str(4)
memory usage: 349.4 KB

In [85]:
reviews.head()
reviews.info()
reviews.columns

<class 'pandas.DataFrame'>
RangeIndex: 4967 entries, 0 to 4966
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   3934       4967 non-null   int64
 1   588.0      4948 non-null   float64
 2   432.0      4921 non-null   float64
 3   7.0999999  4967 non-null   float64
 4   203461     4967 non-null   int64
 5   46000      4967 non-null   int64
dtypes: float64(3), int64(3)
memory usage: 233.0 KB

Index(['3934', '588.0', '432.0', '7.0999999', '203461', '46000'], dtype='str')

In [86]:
reviews = pd.read_csv("../data/raw/reviews.csv", header=None)
reviews.head()

      0       1      2    3       4      5
0  3934   588.0  432.0  7.1  203461  46000
1  3405   285.0  267.0  6.4  149998      0
2   478    65.0   29.0  3.2    8465    491
3    74    83.0   25.0  7.6    7071    930
4  1254  1437.0  224.0  8.0  241030  13000

In [87]:
reviews.columns = [
    "film_id",
    "metric_1",
    "metric_2",
    "avg_rating",
    "vote_count",
    "metric_3"
]

reviews.head()

   film_id  metric_1  metric_2  avg_rating  vote_count  metric_3
0     3934     588.0     432.0         7.1      203461     46000
1     3405     285.0     267.0         6.4      149998         0
2      478      65.0      29.0         3.2        8465       491
3       74      83.0      25.0         7.6        7071       930
4     1254    1437.0     224.0         8.0      241030     13000

## 4. Feature Engineering

### Review Merge
- Merged rating and vote count data from the reviews dataset
- Linked using film ID

### Cast Size Extraction
- Filtered actors from roles dataset
- Counted number of actors per film
- Merged cast size into films dataset

### Target Creation
- Created binary classification label:
  - 1 → avg_rating ≥ 7 (High Rated)
  - 0 → avg_rating < 7 (Low Rated)

In [88]:
films = films.merge(
    reviews[["film_id", "avg_rating", "vote_count"]],
    left_on="id",
    right_on="film_id",
    how="left"
)

films.head()

,id,title,year,country,runtime,language,certificate,budget,revenue,film_id,avg_rating,vote_count
0,1,Intolerance: Love's Struggle Throughout the Ages,1916,USA,123,NaN,Not Rated,0.0,385907.0,1,8.0,10718
1,2,Over the Hill to the Poorhouse,1920,USA,110,NaN,NaN,3000000.0,100000.0,2,4.8,5
2,3,The Big Parade,1925,USA,151,NaN,Not Rated,0.0,245000.0,3,8.3,4849
3,4,Metropolis,1927,Germany,145,German,Not Rated,26435.0,6000000.0,4,8.3,111841
4,5,Pandora's Box,1929,Germany,110,German,Not Rated,9950.0,0.0,5,8.0,7431

In [89]:
films[["id", "avg_rating", "vote_count"]].head()
films["avg_rating"].isnull().sum()

np.int64(0)

In [90]:
films["target"] = (films["avg_rating"] >= 7).astype(int)

In [91]:
films["target"].value_counts()

target
0    3250
1    1718
Name: count, dtype: int64

In [92]:
roles = pd.read_csv("../data/raw/roles.csv", header=None)
roles.head()
roles.shape

(19791, 4)

In [93]:
roles.head()

   0  1     2         3
0  1  1  1630  director
1  2  1  4843     actor
2  3  1  5050     actor
3  4  1  8175     actor
4  5  2  3000  director

In [94]:
roles.columns = ["role_id", "film_id", "person_id", "role_type"]
roles.head()

   role_id  film_id  person_id role_type
0        1        1       1630  director
1        2        1       4843     actor
2        3        1       5050     actor
3        4        1       8175     actor
4        5        2       3000  director

In [51]:
actors = roles[roles["role_type"] == "actor"]

In [95]:
cast_size = (
    actors
    .groupby("film_id")
    .size()
    .reset_index(name="cast_count")
)

cast_size.head()

   film_id  cast_count
0        1           3
1        2           3
2        3           3
3        4           3
4        5           3

In [96]:
films = films.merge(
    cast_size,
    left_on="id",
    right_on="film_id",
    how="left"
)

films["cast_count"] = films["cast_count"].fillna(0)

films.head()

,id,title,year,country,runtime,language,certificate,budget,revenue,film_id_x,avg_rating,vote_count,target,film_id_y,cast_count
0,1,Intolerance: Love's Struggle Throughout the Ages,1916,USA,123,NaN,Not Rated,0.0,385907.0,1,8.0,10718,1,1.0,3.0
1,2,Over the Hill to the Poorhouse,1920,USA,110,NaN,NaN,3000000.0,100000.0,2,4.8,5,0,2.0,3.0
2,3,The Big Parade,1925,USA,151,NaN,Not Rated,0.0,245000.0,3,8.3,4849,1,3.0,3.0
3,4,Metropolis,1927,Germany,145,German,Not Rated,26435.0,6000000.0,4,8.3,111841,1,4.0,3.0
4,5,Pandora's Box,1929,Germany,110,German,Not Rated,9950.0,0.0,5,8.0,7431,1,5.0,3.0

In [97]:
films = films.drop(columns=["film_id_x", "film_id_y"])

In [98]:
films.head()

,id,title,year,country,runtime,language,certificate,budget,revenue,avg_rating,vote_count,target,cast_count
0,1,Intolerance: Love's Struggle Throughout the Ages,1916,USA,123,NaN,Not Rated,0.0,385907.0,8.0,10718,1,3.0
1,2,Over the Hill to the Poorhouse,1920,USA,110,NaN,NaN,3000000.0,100000.0,4.8,5,0,3.0
2,3,The Big Parade,1925,USA,151,NaN,Not Rated,0.0,245000.0,8.3,4849,1,3.0
3,4,Metropolis,1927,Germany,145,German,Not Rated,26435.0,6000000.0,8.3,111841,1,3.0
4,5,Pandora's Box,1929,Germany,110,German,Not Rated,9950.0,0.0,8.0,7431,1,3.0

In [99]:
films.info()

<class 'pandas.DataFrame'>
RangeIndex: 4968 entries, 0 to 4967
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           4968 non-null   int64
 1   title        4968 non-null   str
 2   year         4968 non-null   int64
 3   country      4966 non-null   str
 4   runtime      4968 non-null   int64
 5   language     4955 non-null   str
 6   certificate  4666 non-null   str
 7   budget       4968 non-null   float64
 8   revenue      4968 non-null   float64
 9   avg_rating   4968 non-null   float64
 10  vote_count   4968 non-null   int64
 11  target       4968 non-null   int64
 12  cast_count   4968 non-null   float64
dtypes: float64(4), int64(5), str(4)
memory usage: 504.7 KB

## 5. Save Processed Data

In [100]:
films.to_csv("../data/processed/films_engineered.csv", index=False)

In [101]:
films.columns

Index(['id', 'title', 'year', 'country', 'runtime', 'language', 'certificate',
       'budget', 'revenue', 'avg_rating', 'vote_count', 'target',
       'cast_count'],
      dtype='str')

In [102]:
films.isnull().sum()

id               0
title            0
year             0
country          2
runtime          0
language        13
certificate    302
budget           0
revenue          0
avg_rating       0
vote_count       0
target           0
cast_count       0
dtype: int64

In [103]:
films["target"].value_counts(normalize=True)

target
0    0.654187
1    0.345813
Name: proportion, dtype: float64

In [104]:
df = pd.read_csv("../data/processed/films_engineered.csv")
df.head()
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 4968 entries, 0 to 4967
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           4968 non-null   int64
 1   title        4968 non-null   str
 2   year         4968 non-null   int64
 3   country      4966 non-null   str
 4   runtime      4968 non-null   int64
 5   language     4955 non-null   str
 6   certificate  4666 non-null   str
 7   budget       4968 non-null   float64
 8   revenue      4968 non-null   float64
 9   avg_rating   4968 non-null   float64
 10  vote_count   4968 non-null   int64
 11  target       4968 non-null   int64
 12  cast_count   4968 non-null   float64
dtypes: float64(4), int64(5), str(4)
memory usage: 504.7 KB